<?php error_reporting(-1);

// PSR-1 – Базовый стандарт оформления кода
// В файлах НЕОБХОДИМО использовать только теги <?php и <?=.
// Файлы НЕОБХОДИМО представлять только в кодировке UTF-8 без BOM-байта.
// Константы классов ДОЛЖНЫ быть объявлены исключительно в верхнем регистре с использованием символа подчёркивания для разделения слов.
// Имена методов ДОЛЖНЫ быть объявлены с использованием т.н. «camelCase» (первое слово пишется в нижнем регистре, далее каждое слово начинается с большой буквы, а между словами нет разделителей).

// PSR-2 – Рекомендации по оформлению кода
// Для оформления отступов ДОЛЖНЫ использоваться четыре пробела (но не знак табуляции).
// Открывающая фигурная скобка в определении класса ДОЛЖНА располагаться на новой строке, а закрывающая фигурная скобка ДОЛЖНА располагаться на следующей строке после тела класса.
// Открывающая фигурная скобка в определении метода ДОЛЖНА располагаться на новой строке, а закрывающая фигурная скобка ДОЛЖНА располагаться на следующей строке после тела метода.
// После ключевых слов в управляющих конструкциях ДОЛЖЕН располагаться один пробел, а после вызовов функций и методов – НЕ ДОЛЖЕН.
// Открывающая фигурная скобка в управляющих конструкциях ДОЛЖНА располагаться в той же строке, что и сама конструкция, а закрывающая фигурная скобка ДОЛЖНА располагаться на следующей строке после тела конструкции.
// После открывающей круглой скобки и перед закрывающей круглой скобкой в управляющих конструкциях НЕ ДОЛЖНО быть пробела.


// $a = 1 + 2;
// if ($a) {
//     echo 'Test';
// }


// const TEST2= 'test2';
// echo TEST2;


